package logbook.constants;

/**
 * 装備定数
 *
 */
public enum SlotItemMst {

    大発動艇(68),
    大発動艇_八九式中戦車_陸戦隊(166),
    特大発動艇(193),
    特大発動艇_戦車第11連隊(230),
    M4A1DD(355),
    装甲艇_AB艇(408),
    武装大発(409),
    大発動艇_II号戦車_北アフリカ仕様(436),
    特大発動艇_一式砲戦車(449),
    特大発動艇_Ⅲ号戦車_北アフリカ仕様(482),
    特大発動艇_チハ(494),
    特大発動艇_チハ改(495),
    特大発動艇_Ⅲ号戦車J型(514),
    
    特二式内火艇(167),
    特四式内火艇(525),
    特四式内火艇改(526),
    
    ドラム缶_輸送用(75),
    
    陸軍歩兵部隊(496),
    九七式中戦車_チハ(497),
    九七式中戦車_新砲塔_チハ改(498),
    陸軍歩兵部隊_チハ改(499),

    戦闘糧食(145),
    秋刀魚の缶詰(150),
    戦闘糧食_特別なおにぎり(241),
    
    不明(-1);

    private final int itemid;

    private SlotItemMst(int itemid) {
        this.itemid = itemid;
    }

    /**
     * 装備種定数を返します
     * 
     * @return 装備種定数
     */
    public int getItemid() {
        return this.itemid;
    }
}
